In [1]:
pip install openpyxl

Requirement already satisfied: openpyxl in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (3.0.6)
Requirement already satisfied: jdcal in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (from openpyxl) (1.0.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
q32016 = "../housingcsv/2016q3.xlsx"
df1 = pd.read_excel(q32016,engine='openpyxl')
refine1 = df1.drop(['Sales\n3Q 2015', 'Median\n3Q 2015', 'Median\nChange'], axis=1)
refine1= refine1.rename(columns={'Sales\n3Q 2016': 'Sales Q3 2016', 'Median\nQ3 2016': 'Median Q3 2016'})
refine1

               City          Suburb  Sales Q3 2016  Median\n3Q 2016
0          ADELAIDE        ADELAIDE            6.0         747500.0
1          ADELAIDE  NORTH ADELAIDE            6.0         932000.0
2    ADELAIDE HILLS         ALDGATE           13.0         665000.0
3    ADELAIDE HILLS          ASHTON            NaN              NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN              NaN
..              ...             ...            ...              ...
473    WEST TORRENS       THEBARTON            2.0         516000.0
474    WEST TORRENS    TORRENSVILLE            6.0         605000.0
475    WEST TORRENS       UNDERDALE            6.0         521500.0
476    WEST TORRENS      WEST BEACH           18.0         660000.0
477    WEST TORRENS   WEST RICHMOND            2.0         468500.0

[478 rows x 4 columns]

In [4]:
q42016 = "../housingcsv/2016q4.xlsx"
df2 = pd.read_excel(q42016,engine='openpyxl')
refine2 = df2.drop(['Sales\n4Q 2015', 'Median\n4Q 2015', 'Median\nChange'], axis=1)
refine2 = refine2.rename(columns={'Sales\n4Q 2016':'Sales Q4 2016', 'Median\n4Q 2016': 'Median Q4 2016'})
refine2

               City          Suburb  Sales Q4 2016  Median Q4 2016
0          ADELAIDE        ADELAIDE            6.0        683000.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1231000.0
2    ADELAIDE HILLS         ALDGATE           10.0        695000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
472    WEST TORRENS       THEBARTON            6.0        510000.0
473    WEST TORRENS    TORRENSVILLE           10.0        588000.0
474    WEST TORRENS       UNDERDALE            4.0        567500.0
475    WEST TORRENS      WEST BEACH           11.0        575000.0
476    WEST TORRENS   WEST RICHMOND            8.0        417500.0

[477 rows x 4 columns]

In [5]:
q12017 = "../housingcsv/2017q1.xlsx"
df3 = pd.read_excel(q12017,engine='openpyxl')
refine3 = df3.drop(['Sales\n1Q 2016', 'Median\n1Q 2016', 'Median\nChange'], axis=1)
refine3 = refine3.rename(columns={'Sales\n1Q 2017':'Sales Q1 2017', 'Median\n1Q 2017': 'Median Q1 2017'})
refine3

               City          Suburb  Sales Q1 2017  Median Q1 2017
0          ADELAIDE        ADELAIDE            6.0        627500.0
1          ADELAIDE  NORTH ADELAIDE            6.0        992500.0
2    ADELAIDE HILLS         ALDGATE           14.0        695000.0
3    ADELAIDE HILLS          ASHTON            1.0        415000.0
4    ADELAIDE HILLS    BASKET RANGE            1.0        470000.0
..              ...             ...            ...             ...
473    WEST TORRENS       THEBARTON            3.0        568000.0
474    WEST TORRENS    TORRENSVILLE           12.0        532000.0
475    WEST TORRENS       UNDERDALE            5.0        540000.0
476    WEST TORRENS      WEST BEACH           12.0        670000.0
477    WEST TORRENS   WEST RICHMOND            2.0        419600.0

[478 rows x 4 columns]

In [6]:
q22017 = '../housingcsv/2017q2.xlsx'
df4 = pd.read_excel(q22017,engine='openpyxl')
refine4 = df4.drop(['Sales\n2Q 2016', 'Median\n2Q 2016', 'Median\nChange'], axis=1)
refine4 = refine4.rename(columns={'Sales\n2Q 2017': 'Sales Q2 2017', 'Median\n2Q 2017': 'Median Q2 2017'})
refine4

               City          Suburb  Sales Q2 2017  Median Q2 2017
0          ADELAIDE        ADELAIDE            6.0        900000.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1451000.0
2    ADELAIDE HILLS         ALDGATE           20.0        756000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            2.0        619500.0
..              ...             ...            ...             ...
473    WEST TORRENS       THEBARTON            3.0        682000.0
474    WEST TORRENS    TORRENSVILLE           11.0        597500.0
475    WEST TORRENS       UNDERDALE            4.0        737500.0
476    WEST TORRENS      WEST BEACH           13.0        740000.0
477    WEST TORRENS   WEST RICHMOND            4.0        452500.0

[478 rows x 4 columns]

In [7]:
merged1 = pd.merge(refine1,refine2)
merged2 = pd.merge(refine3,refine4)
final = pd.merge(merged1,merged2)
final = final.dropna(how='any')
final

,City,Suburb,Sales Q3 2016,Median\n3Q 2016,Sales Q4 2016,Median Q4 2016,Sales Q1 2017,Median Q1 2017,Sales Q2 2017,Median Q2 2017
0,ADELAIDE,ADELAIDE,6.0,747500.0,6.0,683000.0,6.0,627500.0,6.0,900000.0
1,ADELAIDE,NORTH ADELAIDE,6.0,932000.0,6.0,1231000.0,6.0,992500.0,6.0,1451000.0
2,ADELAIDE HILLS,ALDGATE,13.0,665000.0,10.0,695000.0,14.0,695000.0,20.0,756000.0
5,ADELAIDE HILLS,BELAIR,8.0,605000.0,18.0,623000.0,18.0,700000.0,19.0,658250.0
7,ADELAIDE HILLS,BRIDGEWATER,16.0,536250.0,12.0,490500.0,18.0,435475.0,19.0,475000.0
...,...,...,...,...,...,...,...,...,...,...
472,WEST TORRENS,THEBARTON,2.0,516000.0,6.0,510000.0,3.0,568000.0,3.0,682000.0
473,WEST TORRENS,TORRENSVILLE,6.0,605000.0,10.0,588000.0,12.0,532000.0,11.0,597500.0
474,WEST TORRENS,UNDERDALE,6.0,521500.0,4.0,567500.0,5.0,540000.0,4.0,737500.0
475,WEST TORRENS,WEST BEACH,18.0,660000.0,11.0,575000.0,12.0,670000.0,13.0,740000.0
476,WEST TORRENS,WEST RICHMOND,2.0,468500.0,8.0,417500.0,2.0,419600.0,4.0,452500.0

In [8]:
final.to_csv("y16_17_house.csv")